export default `
<h3 id="-eqalert-ru">Общая информация о проекте eqalert.ru</h3>
<p>
  <a href="https://eqalert.ru/">eqalert.ru</a> обеспечивает население,
  заинтересованные организации и научное сообщество актуальной информацией о
  землетрясениях, сейсмических воздействиях и сейсмической опасности на
  территории Дальнего Востока России. На сайте доступна онлайн карта
  землетрясений, подробная информация о сейсмических событиях. Информация о
  сейсмической обстановке обновляется в режиме реального времени.
</p>
<p>
  <a href="http://eqalert.ru/">Цель проекта</a> — развитие открытого
  сейсмологического центра на Дальнем Востоке России для исследования
  сейсмической активности, оценки сейсмической опасности и риска, представления
  расширенных результатов обработки исследователям, аварийно-спасательным
  службам, операторам крупных промышленных объектов.
</p>
<p><strong>Задачи проекта:</strong></p>
<ul>
  <li>
    развитие локальной и региональной сети сейсмических и сейсмометрических
    станций;
  </li>
  <li>интеграция данных международных сейсмологических агентств и центров;</li>
  <li>
    внедрение новых методов обработки сейсмологических данных для более точной
    локализации очагов и оценки магнитуды землетрясений;
  </li>
  <li>
    разработка региональных законов затухания сильных движений грунта для
    оперативной оценки сейсмической опасности;
  </li>
  <li>
    разработка и апробация методов оценки степени повреждённости зданий и
    сооружений в результате возникновения сильных землетрясений;
  </li>
  <li>
    создание банка данных зданий и сооружений для отслеживания деградации
    сейсмостойкости строительных объектов;
  </li>
  <li>накопление непрерывного архива цифровых сейсмограмм;</li>
  <li>
    совершенствование методов оценки экономического ущерба от землетрясений;
  </li>
  <li>
    развитие пользовательского интерфейса для публикации результатов
    определений, расчётов и анализа исходных данных;
  </li>
  <li>апробация новых методов прогноза землетрясений;</li>
  <li>апробация новых методов геомеханической симуляции;</li>
  <li>исследование эффектов землетрясений.</li>
</ul>
<p>
  На текущем этапе развития проекта, в непрерывном режиме анализируется
  сейсмическая обстановка в следующих регионах России:
</p>
<ul>
  <li>землетрясения на территории Сахалинской области (M≥3.0);</li>
  <li>землетрясения на территории Камчатского края (M≥4.0)</li>
  <li>землетрясения на территории Хабаровского края (M≥4.0);</li>
  <li>землетрясения на территории Приморского края (M≥4.0);</li>
  <li>землетрясения на территории Республики Саха (Якутия, M≥4.5);</li>
  <li>землетрясения на территории Магаданской области (M≥4.5);</li>
  <li>землетрясения на территории Чукотского автономного округа (M≥4.5);</li>
  <li>землетрясения на территории Еврейской автономной области (M≥4.5);</li>
  <li>землетрясения на территории Амурской области (M≥4.5).</li>
</ul>
<p>
  <a href="https://eqalert.ru/">eqalert.ru</a> объединяет широкий спектр
  технологий. Аппаратно-программный комплекс проекта включает в себя сети
  региональных и глобальных сейсмических станций, подсистемы процессинга
  сейсмологических данных, модули расчета интенсивности землетрясений и
  сейсмических воздействий, интерфейсы обмена сейсмологическими данными.
</p>
<h4 id="-">Сеть сейсмических станций</h4>
<p>
  В проект <a href="https://eqalert.ru/">eqalert.ru</a> интегрированы данные с
  25 сейсмических станций для сейсмического мониторинга Дальнего Востока России.
  Станции передают данные в режиме близком к реальному времени для расчета
  параметров очага землетрясений, оперативного информирования пользователей
  <a href="https://eqalert.ru/">eqalert.ru</a> и аварийно-спасательных служб.
  Данные с сейсмических станций предоставлены
  <a href="https://geophystech.ru/">ООО &quot;ГЕОФИЗТЕХ&quot;</a>,
  <a href="https://www.oia.hokudai.ac.jp/">Хоккайдским Университетом</a>,
  институтами Дальневосточного отделения Российской академии наук [<a
    href="/pdf/instrumentalnoe-i-informatsionno-tehnologicheskoe-obespechenie-seysmologicheskih-nablyudeniy-na-dalnem-vostoke-rossii.pdf"
    >Ханчук и др., 2011</a
  >,
  <a href="https://link.springer.com/article/10.3103/S0747923915030068"
    >Korolev et al., 2015</a
  >] и <a href="http://www.fdsn.org/networks/detail/IU/">IRIS/USGS</a>.
  Регистрирующее оборудование представлено акселерометрами,
  высокочувствительными короткопериодными и широкополосными датчиками.
</p>
<h6 id="-a-href-class-mainpage-map-link-d-none-d-md-block-target-_blank-a-">
  <a href="/" class="mainpage-map-link d-none d-md-block" target="_blank"
    >Посмотреть карту сейсмических станций</a
  >
</h6>
<h4 id="-">Система процессинга сейсмологических данных</h4>
<p>
  Архитектура системы процессинга сейсмологических данных
  <a href="https://eqalert.ru/">eqalert.ru</a> была разработана с учетом
  существующей международной практики построения прикладных информационных
  систем в области сейсмологии.
</p>
<p>
  <a href="https://eqalert.ru/">eqalert.ru</a> реализует подход поэтапной
  обработки зарегистрированной информации. Каждый этап предполагает определенную
  модель реакции, информационные сообщения. Каждый последующий этап
  предоставляет информацию с возрастающим уровнем точности. Модель
  многоуровневого представления информации позволяет многократно проверить
  результаты информационных сообщений для принятия ответственных решений и
  планирования действий по реагированию на нештатные ситуации.
</p>
<details>
  <summary><span>Посмотреть этапы обработки данных</span></summary>
  <img src="/img/about-1.png" />
</details>

<p>
  В рамках проекта реализована интеграция с оперативными автоматизированными
  сервисами
  <a href="https://earthquake.usgs.gov/">Геологической службы США</a> для
  получения информации о параметрах сильных землетрясений. Информация об
  исторической сейсмичности на территории Сахалина в период с 1905 по 2005 год
  добавлена по данным Регионального каталога землетрясений
  <span
    class="tooltip-static-page"
    data-tooltip="Региональный каталог землетрясений о. Сахалин, 1905-2005 / Л.Н. Поплавская и др. – Южно-Сахалинск, ИМГиГ ДВО РАН, 2006. 104 с."
    >[Поплавская и др., 2006]</span
  >.
</p>
<p>
  Технологический стек автоматизированной системы процессинга сейсмических
  данных был апробирован в серии научных публикаций:
</p>
<ul>
  <li>
    выбор одномерной скоростной модели по геологическим и геофизическим данным
    [<a href="https://link.springer.com/article/10.3103/S0747923912030073"
      >Konovalov et al., 2012</a
    >];
  </li>
  <li>
    расчёт локальной магнитуды [<a
      href="https://link.springer.com/article/10.1134/S0742046314060050"
      >Konovalov, Sychev 2014</a
    >];
  </li>
  <li>
    разработка архитектуры автоматизированной системы обработки сейсмологических
    данных [<a
      href="https://link.springer.com/article/10.3103/S0747923914010083"
      >Stepnov et al., 2014</a
    >];
  </li>
  <li>
    внедрение подсистемы автоматического расчёта параметров очага землетрясения
    [<a href="https://link.springer.com/article/10.3103/S0747923917040107"
      >Stepnov et al., 2017</a
    >];
  </li>
  <li>
    оценка точности определений параметров очага и представительности каталога
    землетрясений для о. Сахалин [<a
      href="https://www.youtube.com/watch?v=dNxSln9nttI"
      >Степнов, 2015</a
    >].
  </li>
</ul>
<p>
  Процесс регистрации, сбора, обработки и хранения сейсмологических данных
  организован в соответствии с рекомендациями
  <a href="http://iaspei.org/">Международной сейсмологической комиссии</a>.
</p>
<h4 id="-">Оценка интенсивности</h4>
<p>
  После наступления сейсмического события в районе работ и на прилегающих
  территориях выполняется расчет (моделирование)
  <span
    class="tooltip-static-page"
    data-tooltip="Пиковые ускорения грунта (англ. Peak Ground Acceleration)"
    >PGA</span
  >
  /
  <span
    class="tooltip-static-page"
    data-tooltip="Пиковые скорости грунта (англ. Peak Ground Velocity)"
    >PGV</span
  >
  /
  <span
    class="tooltip-static-page"
    data-tooltip="Спектры ускорений (англ. Pseudo-Spectral Accelerations)"
    >PSA</span
  >
  по региональному закону затухания сейсмических волн. В качестве регионального
  закона затухания применяются общедоступные модифицированные модели затухания с
  оптимизированными региональными коэффициентами [<a
    href="https://github.com/geophystech/GroundMotion.jl"
    >GroundMotion.jl</a
  >,
  <a
    href="http://qes.ifz.ru/fileadmin/user_upload/documents/journals/qes/45-1/02.html"
    >Коновалов и др., 2018</a
  >]. Такой подход позволяет получить численные показатели интенсивности
  землетрясения.
</p>
<p>
  Расчет интенсивности проводится с использованием координатной сетки.
  Координатная сетка покрывает территорию Дальнего Востока России с постоянным
  интервалом между узловыми точками ~500 метров. В процессе расчета
  интенсивности колебаний учитываются данные
  <span
    class="tooltip-static-page"
    data-tooltip="Скорость поперечных сейсмических волн в тридцатиметровом слое верхней части геологического разреза"
    >о локальных грунтовых условиях</span
  >
  в каждой точке. Соотношения между затуханием колебаний и параметрами очага
  землетрясения дополняются с использованием методов средневзвешенного анализа
  на основе измеренных параметров сильных движений, поступивших от сети
  сейсмических станций, зарегистрировавших наступление сейсмического события.
</p>
<p>
  Информация об интенсивности колебаний на базе координатной сетки применяется
  для оценки потенциальных повреждений, которые могут быть нанесены объектам,
  путем расчета по параметрическим функциям, содержащимся в сейсмической базе
  данных проекта.
</p>
<p>
  Информация о сейсмических воздействиях
  <span
    class="tooltip-static-page"
    data-tooltip="Пиковые ускорения грунта (англ. Peak Ground Acceleration)"
    >PGA</span
  >
  приводится к интенсивности
  <span
    class="tooltip-static-page"
    data-tooltip="Шкала сейсмической интенсивности 2017"
    >ШСИ-17</span
  >
  на основе переходных коэффициентов, определённых в [<a
    href="/pdf/gost-57546-2017.pdf"
    >ГОСТ Р 57546-2017</a
  >].
</p>
<details>
  <summary>
    <span
      >Посмотреть эмпирические значения параметров движения грунта [ГОСТ Р
      57546-2017]</span
    >
  </summary>

  <table>
    <tr>
      <th>Интенсивность землетрясения I, баллы</th>
      <th>Пиковое ускорение грунта PGA, %g</th>
    </tr>
    <tr>
      <td>1</td>
      <td>0.044%</td>
    </tr>
    <tr>
      <td>1.5</td>
      <td>0.07%</td>
    </tr>
    <tr>
      <td>2</td>
      <td>0.11%</td>
    </tr>
    <tr>
      <td>2.5</td>
      <td>0.175%</td>
    </tr>
    <tr>
      <td>3</td>
      <td>0.28%</td>
    </tr>
    <tr>
      <td>3.5</td>
      <td>0.44%</td>
    </tr>
    <tr>
      <td>4</td>
      <td>0.7%</td>
    </tr>
    <tr>
      <td>4.5</td>
      <td>1.11%</td>
    </tr>
    <tr>
      <td>5</td>
      <td>1.75%</td>
    </tr>
    <tr>
      <td>5.5</td>
      <td>2.8%</td>
    </tr>
    <tr>
      <td>6</td>
      <td>4.4%</td>
    </tr>
    <tr>
      <td>6.5</td>
      <td>7%</td>
    </tr>
    <tr>
      <td>7</td>
      <td>11%</td>
    </tr>
    <tr>
      <td>7.5</td>
      <td>18%</td>
    </tr>
    <tr>
      <td>8</td>
      <td>28%</td>
    </tr>
    <tr>
      <td>8.5</td>
      <td>44%</td>
    </tr>
    <tr>
      <td>9</td>
      <td>70%</td>
    </tr>
    <tr>
      <td>9.5</td>
      <td>110%</td>
    </tr>
  </table>
</details>

<p>
  Интенсивность в ближайших населенных пунктах дополнительно оценивается по
  шкале
  <a
    href="https://ru.wikipedia.org/wiki/%D0%A8%D0%BA%D0%B0%D0%BB%D0%B0_%D0%9C%D0%B5%D0%B4%D0%B2%D0%B5%D0%B4%D0%B5%D0%B2%D0%B0_%E2%80%94_%D0%A8%D0%BF%D0%BE%D0%BD%D1%85%D0%BE%D0%B9%D0%B5%D1%80%D0%B0_%E2%80%94_%D0%9A%D0%B0%D1%80%D0%BD%D0%B8%D0%BA%D0%B0"
    >MSK-64</a
  >
  [<span
    class="tooltip-static-page"
    data-tooltip="Оскорбин Л.С. Уравнения сейсмического поля сахалинских землетрясений // Сейсмическое районирование Сахалина. Владивосток: ДВНЦ АН СССР, 1977. С. 3-22."
    >Оскорбин Л.С., 1977</span
  >;
  <a href="http://repo.kscnet.ru/1645/">Федотов С.А., Шумилина Л.С., 1971</a>,
  <a href="/pdf/gost-57546-2017.pdf">ГОСТ Р 57546-2017</a>].
</p>
<h4 id="-eqalert-ru">Использование материалов проекта eqalert.ru</h4>
<p>
  <strong
    >При использовании (воспроизведении, копировании) в сети Интернет любых
    материалов, размещенных на информационном ресурсе eqalert.ru, указание
    прямой ссылки является обязательным. Все URL адреса eqalert.ru, включая URL
    на сейсмические события, имеют постоянные ссылки.</strong
  >
</p>
`
