<template>
  <div>
    <b-container>
      <b-row>
        <b-col>
          <h2 class="mt-4">О сервисе</h2>
          <p>
            Сервис EQAlert осуществляет онлайн-мониторинг землетрясений на территории
            Российской Федерации и уведомляет пользователей об их возникновении.
            Сервис разработан при финансовой поддержке
            <a href="https://fasie.ru/" target="_blank">Фонда содействия инновациям</a>.
          </p>
        </b-col>
      </b-row>
      <b-row>
        <b-col>
          <h2 class="mt-4">Как это работает</h2>
          <p>
            EQAlert получает данные о землетрясениях из различных источников,
            анализирует их и формирует уведомления, которые отправляются на мобильные устройства
            зарегистрированных пользователей. Уникальная функция сервиса - это автоматическая генерация
            карты сотрясаемости и оценка сейсмических воздействий в текущей локации пользователя.
            Кроме того, сервис предоставляет информацию о прошлых землетрясениях, позволяя пользователям
            изучить историю сейсмической активности на интерактивной карте.
          </p>
        </b-col>
      </b-row>
      <b-row>
        <b-col>
          <h2 class="mt-4">Для кого</h2>
          <p>
            Сервис предназначен для различных категорий пользователей, включая специалистов
            в области геофизики, сейсмологии и строительства, а также для простых граждан,
            желающих быть в курсе происходящих землетрясений.
          </p>
        </b-col>
      </b-row>
      <b-row>
        <b-col>
          <h2 class="mt-4">Команда разработчиков</h2>
          <p>
            Сервис разработан командой геофизиков и программистов,
            обладающих большим опытом в области изучения землетрясений и оценки сейсмической опасности.
            Мы постоянно работаем над улучшением сервиса и внедрением новых функций, чтобы сделать
            его еще более полезным и удобным для пользователей.
          </p>
        </b-col>
      </b-row>
      <b-row>
        <b-col>
          <h2 class="mt-4">Сотрудничество</h2>
          <p>
            Мы открыты для сотрудничества с государственными организациями, научными и образовательными
            учреждениями, а также предприятиями и частными лицами.
            Если у вас есть предложения или вопросы, связанные с сервисом EQAlert,
            пожалуйста, <a href="mailto:support@geophystech.ru">свяжитесь с нами</a>.
          </p>
        </b-col>
      </b-row>
      <b-row>
        <b-col>
          <h2 class="mt-4">Узнать больше</h2>
          <p>
            Техническая документация приведена <a href="https://preprints.ru/files/1090" target="_blank">здесь</a>.
          </p>
        </b-col>
      </b-row>
      <b-row>
        <b-col>
          <h2 class="mt-4">Использование данных сервиса</h2>
          <p>
            При использовании в сети Интернет материалов сервиса просим указывать ссылку на информационный ресурс <a href="https://eqalert.ru/" target="_blank">Eqalert.ru</a>.
            Цитирование в научных статьях:
            <a href="https://link.springer.com/article/10.3103/S0747923922060081" target="_blank">Konovalov, A.V., Stepnov, A.A., Bogdanov, E.S. et al. New Tools for Rapid Assessment of Felt Reports and a Case Study on Sakhalin Island. Seism. Instr. 58, 676–693 (2022). https://doi.org/10.3103/S0747923922060081</a>
          </p>
        </b-col>
      </b-row>
    </b-container>
  </div>
</template>

<script>
export default {
  name: 'about',
  head() {
    return {
      title: 'О сервисе',
      meta: [
        {
          hid: 'description',
          name: 'description',
          content: "eqalert.ru - Сейсмологический сервис, предоставляющий актуальную информацию о землетрясениях на территории Российской Федерации. На сайте и мобильных приложениях представлена интерактивная карта землетрясений и подробная информация о произошедших событиях, обновляемая в режиме реального времени. Цель сервиса - развитие национального сейсмологического дата-центра для исследования сейсмической активности, оценки сейсмической опасности и риска. В сервисе используются данные международных и российских сейсмологических агентств, а также инструментальные измерения в рамках Сахалинской области."
        },
      ]
    }
  },
}
</script>

<style lang="scss" scoped>

@import 'assets/scss/_variables';
@import 'assets/scss/_mixins';
@import 'assets/scss/_modal_map.scss';

.static-page-content /deep/
{
  margin-top: 3%;

  h1, h2, h4, h5 {
    text-align: center !important;
  }

  img {
    display: block;
    margin: 0 auto;
    max-width: 100%;
  }
}

nested-container {
  display: block;
  text-align: left !important;
  .nested-container__title {
    font-weight: bold;
  }
}

.first-level, .second-level, .third-level {
  padding-left: 1rem;
}

</style>
