<template>
  <div>
    <!---
    Описание построено по структуре вложенного текста. То есть вложенный текст раскрывается после клика. Следующее по уровню вложение раскрывается после очередного клика и т.д.
    Все что должно раскрываться выделено жирным текстом. В структуре описания сохраняется строгая иерархия вложений, которая отмечена отступом.
    Гиперссылки все обозначены. Проверь пожалуйста все ли ссылки активны
    Все что выделено желтым цветом должно быть в виде подсказки, то есть наводишь курсор и тебе всплывает подсказка-расшифровка. Сейчас на сайте так сделано. Это удобно
    Кроме того, прошу поменять название на главной странице: "О проекте" заменить на "О сервисе".
    --->
    <div class="static-page-content">
      <h3 id="-eqalert-ru">Общая информация</h3>

      <p>
        Сейсмологический сервис
        <a href="https://eqalert.ru/" target="_blank">eqalert.ru</a> обеспечивает население,
        органы власти, коммерческие компании, образовательные организации и
        научное сообщество актуальной информацией о землетрясениях на территории
        Российской Федерации.
        Сервис производит оценку сейсмических воздействий на объекты городской инфраструктуры
        с помощью методов математического моделирования, оперативной информации о параметрах
        землетрясения и геопространственных данных. На сайте сервиса и его мобильных приложениях
        представлена интерактивная карта землетрясений и подробная информация о произошедших
        сейсмических событиях. Информация о сейсмической обстановке обновляется в режиме реального времени.
        Сервис разработан при финансовой поддержке
        <a href="https://fasie.ru/" target="_blank">Фонда содействия инновациям</a>
        (договор 29ГРСОПР-С7-I5/63664 от 25.11.2020 г., заявка Р-83368).
      </p>

      <p><strong>Цель сервиса</strong></p>
      <p>
        Цель сервиса – развитие национального сейсмологического дата-центра для исследования
        сейсмической активности, оценки сейсмической опасности и риска, предоставления
        расширенных результатов обработки исследователям, аварийно-спасательным службам,
        операторам крупных промышленных объектов.
      </p>

      <p><strong>Задачи проекта</strong></p>
      <ul>
        <li>
          развитие инженерно-сейсмологической сети станций;
        </li>
        <li>
          интеграция в сервис данных международных и российских сейсмологических агентств;
        </li>
        <li>
          внедрение новых методов обработки сейсмологических данных для более точной
          локализации очагов и оценки магнитуды землетрясений;
        </li>
        <li>
          разработка региональных законов затухания сильных движений грунта для
          оперативной оценки сейсмической опасности;
        </li>
        <li>
          разработка и апробация методов оценки степени повреждённости зданий и
          сооружений в результате возникновения сильных землетрясений;
        </li>
        <li>
          совершенствование методов оценки экономического ущерба от землетрясений;
        </li>
        <li>
          развитие пользовательского интерфейса для публикации результатов анализа исходных данных;
        </li>
        <li>
          исследование эффектов землетрясений.
        </li>
      </ul>

      <h3>Используемые данные</h3>

      <p>
        Данные о параметрах землетрясения (время, координаты и магнитуда) становятся
        доступными на сервисе после обработки инструментальных измерений или публикации
        информации о землетрясении крупными сейсмологическими агентствами.
        Инструментальные измерения в рамках сервиса охватывают только Сахалинскую область.
        Для других субъектов Российской Федерации используются внешние источники данных,
        которые поставляют оперативную информацию о произошедших землетрясениях.
        Использование нескольких источников позволяет повысить оперативность уведомлений.
        Тем самым обеспечивается и полнота информации.<br/>
        Станции, интегрированные в сервис, передают зарегистрированную информацию в
        центр обработки данных в режиме, близком к реальному времени.
        Далее производятся автоматический расчет параметров землетрясений,
        проверка результатов оператором и оперативное информирование аварийно-спасательных
        служб и пользователей сервиса. Регистрирующее оборудование представлено
        акселерометрами и короткопериодными датчиками, а также станциями
        организаций-партнеров.
      </p>

      <h6 id="-a-href-class-mainpage-map-link-d-none-d-md-block-target-_blank-a-">
        <a
          @click="showMap"
          style="cursor: default"
          class="mainpage-map-link d-none d-md-block"
        >
          Показать карту станций
        </a>
      </h6>

      <details>
        <summary><span>Показать внешние источники данных</span></summary>
        <ul>
          <li>
            <a href="https://earthquake.usgs.gov/fdsnws/event/1/" target="_blank">
              Геологическая служба США (USGS).
            </a>
          </li>
          <li>
            <a href="https://geofon.gfz-potsdam.de/waveform/webservices/fdsnws.php" target="_blank">
              Потсдамский центр наук о Земле (GFZ).
            </a>
          </li>
          <li>
            <a href="https://www.emsc-csem.org/#2" target="_blank">
              Европейско-средиземноморский сейсмологический центр (EMSC).
            </a>
          </li>
        </ul>
      </details>

      <h3>Система обработки данных</h3>

      <p>
        Система обработки данных состоит из нескольких подсистем.
        Ключевыми из них являются подсистемы автоматической
        обработки и пост-процессинга. Для этого реализована
        поэтапная обработка зарегистрированной информации.
        Каждый этап предполагает определенную реакцию оператора
        и системы в целом. Каждый последующий этап предоставляет
        информацию с возрастающим уровнем точности.
        Модель многоуровневого представления информации позволяет
        многократно проверить результаты информационных сообщений
        для принятия ответственных решений и планирования действий
        по реагированию на нештатные ситуации. Архитектура
        автоматизированной системы обработки сейсмологических
        данных разработана с учетом существующей международной
        практики построения прикладных информационных систем в области сейсмологии.
        Процесс регистрации, сбора, обработки и хранения сейсмологических данных
        организован в соответствии с рекомендациями
        <a href="http://iaspei.org/" target="_blank">Международной сейсмологической комиссии</a>.
      </p>

      <details>
        <summary><span>Показать этапы обработки</span></summary>
        <img src="/img/about-1.png" />
      </details>

      <p><strong>Методы обработки инструментальных данных</strong></p>
      <p>
        Технологичный стек автоматизированной системы процессинга
        сейсмологических данных и методология обработки представлены
        в серии научных публикаций:
      </p>
      <ul>
        <li>
          подбор и практическое обоснование скоростной модели по
          геологическим и геофизическим данным, оценка точности гипоцентральных определений
          [<a
            href="https://link.springer.com/article/10.3103/S0747923912030073"
            target="_blank"
          >
            Konovalov et al., 2012
          </a>];
        </li>
        <li>
          калибровка локальной магнитуды
          [<a
            href="https://link.springer.com/article/10.1134/S0742046314060050"
            target="_blank"
          >
            Konovalov, Sychev, 2014
          </a>];
        </li>
        <li>
          разработка архитектуры автоматизированной системы обработки сейсмологических данных
          [<a
            href="https://link.springer.com/article/10.3103/S0747923914010083"
            target="_blank"
          >
            Stepnov et al., 2014
          </a>];
        </li>
        <li>
          внедрение подсистемы автоматического расчёта параметров очага землетрясения
          [<a
            href="https://link.springer.com/article/10.3103/S0747923917040107"
            target="_blank"
          >
            Stepnov et al., 2017
          </a>];
        </li>
        <li>
          апробация подсистемы автоматической обработки сейсмологических данных на реальных землетрясениях
          [<a
            href="https://link.springer.com/article/10.1007/s10950-018-9744-y"
            target="_blank"
          >
            Konovalov et al., 2018
          </a>];
        </li>
        <li>
          разработка и применение новых методов машинного обучения для обработки сейсмологических данных
          [<a
            href="https://www.mdpi.com/1424-8220/21/18/6290"
            target="_blank"
          >
            Stepnov et al., 2021
          </a>];
        </li>
        <li>
          оценка представительности каталога землетрясений
          [<a
            href="https://link.springer.com/article/10.1007/s00024-022-03006-y"
            target="_blank"
          >
            Konovalov et al., 2022
          </a>].
        </li>
      </ul>

      <p><strong>Импорт данных с внешних источников</strong></p>
      <p>
        Для получения информации о параметрах сильных землетрясений
        реализован автоматический импорт данных, публикуемых
        оперативными автоматизированными сервисами и службами.
        Импорт данных с внешних источников производится с помощью API.
        <br/>
        Информация агентства, которое первое опубликует
        параметры землетрясения, будет далее использоваться в
        моделировании параметров сейсмических воздействий,
        однако если позже появляются данные от источника, расположенного в
        более приоритетном порядке, то расчеты уточняются с учетом новых данных.
        На практике такие действия контролируются (1) регулярными запросами данных
        с различных источников, (2) проверкой наличия дубликатов при появлении
        новых данных и (3) выбором приоритетных данных при наличии дубликатов.
        Все магнитудные оценки сводятся к моментной шкале, что регулируется
        соответствующими межмагнитудными соотношениями [Konovalov et al., 2022].
        <br/>
        Рейтинг сейсмологических агентств составлен с учетом доступности,
        скорости обработки и качества опубликованных данных.
        Данный рейтинг определяет приоритетность использования внешних источников:
      </p>
      <ul>
        <li>
          Инструментальное измерение / Региональный каталог.
        </li>
        <li>
          <a href="https://earthquake.usgs.gov/fdsnws/event/1/" target="_blank">
            Геологическая служба США (USGS)
          </a>.
        </li>
        <li>
          <a href="https://geofon.gfz-potsdam.de/waveform/webservices/fdsnws.php" target="_blank">
            Потсдамский центр наук о Земле (GFZ)
          </a>.
        </li>
        <li>
          <a href="https://www.emsc-csem.org/#2" target="_blank">
            Европейско-средиземноморский сейсмологический центр (EMSC)
          </a>.
        </li>
      </ul>
      <p>
        Информация об исторической сейсмичности территории
        Сахалина в период с 1905 по 2005 гг. добавлена по
        данным регионального каталога землетрясений
        [Поплавская и др., 2006].
      </p>

      <p><strong>Типы магнитуд</strong></p>
      <p>
        Mww – моментная магнитуда, определяемая путем инверсии записей
        W-фаз и оценки тензора сейсмического момента.
        <br/>
        Mw – моментная магнитуда, определяемая путем инверсии записей
        длинопериодных колебаний и оценки тензора сейсмического момента.
        <br/>
        Mb (mb) – магнитуда, определяемая по телесейсмическим записям P-волны.
        <br/>
        ML – локальная магнитуда, измеряемая по максимальному смещению
        в S-волне на вертикальной компоненте записи
        (эмулированной в режиме сейсмометра Вуда-Андерсона).
        <br/>
        M – неизвестный тип магнитуды.
      </p>

      <h3>Ощутили землетрясение?</h3>

      <p>
        В сервисе реализован сбор откликов от населения через интернет.
        Обратную связь от населения сервис получает с помощью
        опросного листа «Ощутили землетрясение?».
        Ответив на несколько вопросов анкеты, пользователи помогают
        уточнить интенсивность колебаний в области воздействия
        землетрясения. Автоматическая оценка макросейсмической
        интенсивности производится в тех населенных пунктах,
        из которых поступили отклики. Обработанная информация
        доступна пользователям сервиса без ограничений.
        <br/>
        Помимо измерения макросейсмических эффектов через
        отклики от населения, интенсивность в ближайших
        населенных пунктах моделируется согласно эмпирическому
        уравнению макросейсмического поля.
      </p>

      <p><strong>Сбор откликов</strong></p>
      <p>
        Сбор откликов осуществляется через
        <a href="https://eqalert.ru/felt-report" target="_blank">сайт сервиса</a>
        , мобильные приложения на базе операционных систем
        <a href="https://itunes.apple.com/ru/app/eqalert/id1448087679" target="_blank">iOS</a>
        и
        <a href="https://play.google.com/store/apps/details?id=ru.geophystech.eqalert" target="_blank">Android</a>
        , а также
        <a href="https://t.me/eqalert_ru_bot" target="_blank">Telegram-бот</a>
        . Данные программы доступны для загрузки без ограничений.
      </p>

      <p><strong>Методика обработки откликов</strong></p>
      <p>
        Для оперативной оценки сейсмической интенсивности
        по откликам от населения используется опросный лист
        в соответствии с методикой DYFI [Wald et al., 1999].
        Ответы респондентов в каждом населенном пункте
        приводятся к взвешенной сумме CWS с учетом различных
        индикаторов сейсмических колебаний: ощущение людьми,
        положение предметов и мебели в пространстве, характер
        повреждения зданий. Полученные оценки приводятся к
        интенсивности ШСИ-2017 с округлением до десятых.
      </p>
      <p>
        При заполнении формы респондент может выбрать из
        списка землетрясение, с которым, по его мнению,
        связаны ощутимые колебания. С целью обработки ранних
        откликов, когда еще недоступна информация о
        произошедшем землетрясении, разработан алгоритм
        автоматического поиска и привязки неассоциированных
        откликов к конкретному сейсмическому событию после
        появления о нем информации. При обработке откликов
        учитывается геолокация респондента и производится
        привязка полученных ответов к конкретному населенному пункту.
      </p>
      <p>
        Более подробная информация о методике обработки
        откликов приведена в
        [<a
          href="https://link.springer.com/article/10.3103/S0747923922060081"
          target="_blank"
        >Konovalov et al., 2022</a>].
      </p>

      <h3>Построение карт сотрясаемости</h3>

      <p>
        Моделирование поля сейсмических воздействий и генерация
        карт сотрясаемости запускаются после того, как в базе данных
        сервиса появляется новое событие. Карты строятся на основе
        смоделированных количественных характеристик движения грунта в
        каждой точке пространства по эмпирическому уравнению затухания
        сейсмических воздействий и с учетом геопространственных данных.
        Закон затухания определяет характер затухания сейсмических
        воздействий с расстоянием в зависимости от магнитуды
        сейсмического события. Уровень сейсмических воздействий
        зависит также от грунтовых условий в пункте наблюдения,
        слоистости среды и других количественных параметров
        геофизической среды и очага землетрясения.
      </p>
      <p>
        В качестве меры сейсмических воздействий используются
        пиковое ускорение грунта и сейсмическая интенсивность.
      </p>
      <p>
        Расчет поля сейсмических воздействий выполняется на сетке с
        шагом около 500 м. При запуске расчетного модуля загружается
        сетка, заданная в конфигурационном файле. В заданных
        точках выполняется расчет параметров сейсмических
        воздействий по заданным уравнениям затухания.
        Пиковое усокрение грунта рассчитывается в %g и для
        удобства интерпретации приводится к баллу ШСИ-2017 согласно
        <a
          href="https://eqalert.ru/static/pdf/gost-57546-2017.pdf"
          target="_blank"
        >ГОСТ Р 57546-2017</a>.
        Поле сейсмической интенсивности моделируется в баллах шкалы MSK-64.
      </p>
      <p>
        Отрисовка карт сотрясаемости выполняется в виде изолиний,
        соответствующих баллам сейсмической интенсивности.
        В качестве подложек используются Яндекс.Карты и Google Maps.
      </p>

      <p><strong>Методика обработки откликов</strong></p>
      <p>
        Территория РФ и сопредельные районы были поделены на
        отдельные зоны, представленные в виде прямоугольников.
        Деление на зоны производилось таким образом, чтобы,
        с одной стороны, их количество было не таким большим
        (первые десятки), а с другой – с каждой зоной можно было
        проассоциировать соответствующее уравнение затухания.
      </p>

      <!---
      Здесь будет КАРТА-1 и подпись к рисунку:
      Названия и расположение зон мониторинга, а также территориальные границы субъектов РФ по состоянию на 01.01.2022 г.
      --->
      <details>
        <summary><span>Показать зоны мониторинга</span></summary>
        <img src="/img/map-1.png" />
        <p class="legend-title -align-center text-center justify-content-center">
          Названия и расположение зон мониторинга, а также территориальные границы субъектов РФ по состоянию на 01.01.2022 г.
        </p>
      </details>

      <p><strong>Уравнения затухания пикового ускорения грунта</strong></p>
      <p>
        Для каждой зоны мониторинга подобрано соответствующее
        уравнение затухания пикового ускорения грунта из
        опубликованных научных статей с глобальными и
        региональными моделями. Подбор уравнений осуществлялся
        исходя из сейсмотектонического принципа дискриминации
        сейсмогенных участков Земли и воспроизводимости вычислений
        в условиях дефицита геофизической информации.
        Приоритет при выборе моделей отдавался эмпирическим
        соотношениям, в которых использовалось гипоцентральное
        расстояние в качестве метрики расстояния.
      </p>

      <!---
      Здесь будет КАРТА-2 и подпись к рисунку:
      Расположение зон мониторинга на территории РФ и сопредельных стран, подверженных сейсмическому риску, с отметкой соответствующей конфигурации уравнения затухания пикового ускорения грунта. Красным цветом показаны области со стабильной корой согласно [Schulte, Mooney, 2005]. Желтым цветом отмечены территориальные границы РФ по состоянию на 01.01.2022 г.
      --->
      <details>
        <summary><span>Показать конфигурацию зон мониторинга</span></summary>
        <img src="/img/map-2.png" />
        <p class="legend-title -align-center text-center justify-content-center">
          Расположение зон мониторинга на территории РФ и сопредельных стран, подверженных сейсмическому риску, с отметкой соответствующей конфигурации уравнения затухания пикового ускорения грунта. Красным цветом показаны области со стабильной корой согласно [Schulte, Mooney, 2005]. Желтым цветом отмечены территориальные границы РФ по состоянию на 01.01.2022 г.
        </p>
      </details>

      <details>
        <summary><span>Показать расшифровку конфигураций</span></summary>
        <table>
          <tr>
            <th>Наименование конфигурации уравнения затухания сейсмических ускорений</th>
            <th>Расшифровка</th>
          </tr>
          <tr>
            <td>AB1995</td>
            <td>Глобальная модель затухания для регионов со стабильной корой [Atkinson, Boore, 1995]</td>
          </tr>
          <tr>
            <td>AS1997</td>
            <td>Глобальная модель затухания для регионов с активной корой [Abrahamson, Silva, 1997]</td>
          </tr>
          <tr>
            <td>ASB2013</td>
            <td>Региональная модель затухания для Европы и Ближнего Востока [Akkar et al., 2014]</td>
          </tr>
          <tr>
            <td>ASB2013*</td>
            <td>Модификация модели ASB2013</td>
          </tr>
          <tr>
            <td>JSGGA2022</td>
            <td>Региональная модель затухания, разработанная по записям местных коровых землетрясений в Грузии и соседствующем Кавказе [Jorjiashvili et al., 2022]</td>
          </tr>
          <tr>
            <td>MF2013_1</td>
            <td>Региональная модель затухания, разработанная по записям местных коровых землетрясений в Японии [Morikawa, Fujiwara, 2013]</td>
          </tr>
          <tr>
            <td>MF2013_2</td>
            <td>Региональная модель затухания, разработанная по записям межплитовых субдукционных землетрясений в Японии [Morikawa, Fujiwara, 2013]</td>
          </tr>
          <tr>
            <td>MF2013_3</td>
            <td>Региональная модель затухания, разработанная по записям внутриплитовых субдукционных землетрясений в Японии [Morikawa, Fujiwara, 2013]</td>
          </tr>
          <tr>
            <td>AB1995+AS1997</td>
            <td>Гибрид моделей AB1995 и AS1997</td>
          </tr>
          <tr>
            <td>AB1995+ASB2013</td>
            <td>Гибрид моделей AB1995 и ASB2013</td>
          </tr>
          <tr>
            <td>Sakh2018+AS1997</td>
            <td>Гибрид моделей Sakh2018 и AS1997, где Sakh2018 – региональная модель затухания, разработанная по записям сахалинских землетрясений [Коновалов и др., 2018]</td>
          </tr>
        </table>
      </details>

      <p><strong>Уравнения затухания сейсмической интенсивности</strong></p>
      <p>
        Для оценки интенсивности землетрясений в каждой из зон
        используется уравнение макросейсмического поля.
        Коэффициенты уравнения взяты из Таблицы 1
        <a
          href="https://eqalert.ru/static/pdf/gost-57546-2017.pdf"
          target="_blank"
        >ГОСТ Р 57546-2017</a>,
        в которой каждому сейсмичному региону соответствует
        конфигурация уравнения затухания с известными эмпирическими
        коэффициентами.
      </p>

      <!----
      Здесь будет КАРТА-3 и подпись к рисунку:
      Расположение зон мониторинга на территории РФ и сопредельных стран, подверженных сейсмическому риску, с отметкой соответствующей конфигурации уравнения макросейсмического поля. Желтым цветом отмечены территориальные границы РФ по состоянию на 01.01.2022 г.
      ---->
      <details>
        <summary><span>Показать конфигурацию зон мониторинга</span></summary>
        <img src="/img/map-3.png" />
        <p class="legend-title -align-center text-center justify-content-center">
          Расположение зон мониторинга на территории РФ и сопредельных стран, подверженных сейсмическому риску, с отметкой соответствующей конфигурации уравнения макросейсмического поля. Желтым цветом отмечены территориальные границы РФ по состоянию на 01.01.2022 г.
        </p>
      </details>

      <details>
        <summary><span>Показать расшифровку конфигураций</span></summary>
        <table>
          <tr>
            <th>Наименование конфигурации уравнения затухания сейсмической интенсивности</th>
            <th>Расшифровка</th>
          </tr>
          <tr>
            <td>OTHERS</td>
            <td>Среднее значение</td>
          </tr>
          <tr>
            <td>LENING</td>
            <td>Ленинградская область</td>
          </tr>
          <tr>
            <td>N-CAUC</td>
            <td>Северный Кавказ</td>
          </tr>
          <tr>
            <td>DAGEST</td>
            <td>Дагестан</td>
          </tr>
          <tr>
            <td>KAMCH</td>
            <td>Камчатка</td>
          </tr>
          <tr>
            <td>KURIL</td>
            <td>Курильские острова</td>
          </tr>
          <tr>
            <td>SAKH</td>
            <td>Сахалин</td>
          </tr>
        </table>
      </details>

      <p><strong>Сравнительные характеристики движения грунта</strong></p>
      <p>
        ШСИ-2017 является результатом модификации шкалы MSK-64 и
        гармонизации нескольких шкал интенсивности, поэтому расчетные
        и измеренные значения сейсмической интенсивности по разным
        шкалам можно считать
        <a
          href="https://vk.com/@geophystech-pochemu-vazhno-ostavit-otklik-ob-oschutimom-zemletryasenii-n"
          target="_blank"
        >взаимно согласующимися</a>.
      </p>
      <p>
        Между измеренным значением пикового ускорения грунта и
        интенсивностью, полученной по откликам от населения,
        установлена эмпирическая связь
        [<a
          href="https://link.springer.com/article/10.3103/S0747923922060081"
          target="_blank"
        >Konovalov et al., 2022</a>],
        которая используется в оперативной оценке средневзвешенного
        поля сейсмических воздействий. Это означает, что интенсивность
        можно пересчитывать в физически измеряемые характеристики
        движения грунта и наоборот.
      </p>
      <p>
        В оценках риска повреждения объектов городской инфраструктуры
        используются параметрические функции, основанные на
        сейсмическом ускорении как базовой характеристике сейсмостойкости.
      </p>

      <details>
        <summary>
          <span>Посмотреть эмпирические значения параметров движения грунта [ГОСТ Р57546-2017]</span>
        </summary>

        <table>
          <tr>
            <th>Интенсивность землетрясения I, баллы</th>
            <th>Пиковое ускорение грунта PGA, %g</th>
          </tr>
          <tr>
            <td>1</td>
            <td>0.044%</td>
          </tr>
          <tr>
            <td>1.5</td>
            <td>0.07%</td>
          </tr>
          <tr>
            <td>2</td>
            <td>0.11%</td>
          </tr>
          <tr>
            <td>2.5</td>
            <td>0.175%</td>
          </tr>
          <tr>
            <td>3</td>
            <td>0.28%</td>
          </tr>
          <tr>
            <td>3.5</td>
            <td>0.44%</td>
          </tr>
          <tr>
            <td>4</td>
            <td>0.7%</td>
          </tr>
          <tr>
            <td>4.5</td>
            <td>1.11%</td>
          </tr>
          <tr>
            <td>5</td>
            <td>1.75%</td>
          </tr>
          <tr>
            <td>5.5</td>
            <td>2.8%</td>
          </tr>
          <tr>
            <td>6</td>
            <td>4.4%</td>
          </tr>
          <tr>
            <td>6.5</td>
            <td>7%</td>
          </tr>
          <tr>
            <td>7</td>
            <td>11%</td>
          </tr>
          <tr>
            <td>7.5</td>
            <td>18%</td>
          </tr>
          <tr>
            <td>8</td>
            <td>28%</td>
          </tr>
          <tr>
            <td>8.5</td>
            <td>44%</td>
          </tr>
          <tr>
            <td>9</td>
            <td>70%</td>
          </tr>
          <tr>
            <td>9.5</td>
            <td>110%</td>
          </tr>
        </table>
      </details>

      <p><strong>Средневзвешенный анализ</strong></p>
      <p>
        Систематическая недооценка реального уровня сейсмических
        колебаний может приводить к искаженной картине ситуационной
        обстановки и недооценке реальных последствий. Это в свою
        очередь влияет на безопасность людей, которые оказались в
        зоне интенсивных сейсмических воздействий, способных вызвать
        повреждения объектов городской инфраструктуры.
      </p>
      <p>
        <a
          href="https://fips.ru/publication-web/publications/document?type=doc&tab=PrEVM&id=F00690DE-5FEE-4F0D-9131-C12EF2EC1915"
          target="_blank"
        >Уникальная методика</a>
        моделирования поля средневзвешенных параметров сейсмических
        воздействий, разработанная и реализованная в рамках сервиса,
        производит корректировку модельных значений сейсмических ускорений
        в относительно большом радиусе от места измерения ускорения или
        макросейсмической интенсивности.
      </p>
      <p>
        Таким образом, при наступлении сейсмического события в
        экспресс-режиме генерируется карта сотрясаемости в физически
        измеряемых единицах. Это является важным этапом, предваряющим
        оценку риска повреждения объектов городской инфраструктуры.
      </p>

      <!---
      Здесь будут раскрываться КАРТА-4 и КАРТА-5.
      К каждой карте будет подпись.
      Подпись к карте-4:
      Карта смоделированного поля сейсмических ускорений, приведенных к интенсивности, с шагом 0.5 км для Тымовского землетрясения (ML 4.5), произошедшего 18 апреля 2021 г. на севере о. Сахалин.
      Подпись к карте-5:
      Карта средневзвешенного поля сейсмических ускорений, приведенных к интенсивности, с шагом 0.5 км для Тымовского землетрясения (ML 4.5), произошедшего 18 апреля 2021 г. на севере о. Сахалин.
      ---->
      <details>
        <summary><span>Показать пример карт сотрясаемости до и после применения методики</span></summary>
        <img src="/img/map-4.png" />
        <p class="legend-title -align-center text-center justify-content-center">
          Карта смоделированного поля сейсмических ускорений, приведенных к интенсивности, с шагом 0.5 км для Тымовского землетрясения (ML 4.5), произошедшего 18 апреля 2021 г. на севере о. Сахалин.
        </p>
        <img src="/img/map-5.png" />
        <p class="legend-title -align-center text-center justify-content-center">
          Карта средневзвешенного поля сейсмических ускорений, приведенных к интенсивности, с шагом 0.5 км для Тымовского землетрясения (ML 4.5), произошедшего 18 апреля 2021 г. на севере о. Сахалин.
        </p>
      </details>

      <h3>Стек технологий</h3>

      <p>
        Сервис построен по принципу микросервисной архитектуры.
        Каждый отдельный компонент сервиса выполняет свою
        функцию в непрерывном процессе обработки данных.
        Ключевыми компонентами являются:
      </p>

      <ol>
        <li>
          <a
            href="https://rest-api.eqalert.ru/"
            target="_blank"
          >Интерфейс прикладного программирования</a>,
          реализующий обмен данными между компонентами сервиса по
          технологии RESTfull API.
        </li>
        <li>
          База данных с информацией о всех полученных и
          рассчитанных данных.
        </li>
        <li>
          Служба, объединяющая атомарные задачи по импорту данных из
          внешних источников.
        </li>
        <li>
          Служба (модуль) расчёта сейсмических воздействий.
        </li>
        <li>
          Служба, предназначенная для автоматического расчёта интенсивности
          по данным откликов от населения.
        </li>
        <li>
          Интерфейсы клиентов:
          <a
            href="https://t.me/eqalert_ru_bot"
            target="_blank"
          >Telegram-бот</a>
          ,
          <a
            href="https://eqalert.ru/"
            target="_blank"
          >веб-сайт</a>
          , мобильные приложения
          для
          <a
            href="https://itunes.apple.com/ru/app/eqalert/id1448087679"
            target="_blank"
          >iOS</a>
          и
          <a
            href="https://play.google.com/store/apps/details?id=ru.geophystech.eqalert"
            target="_blank"
          >Android</a>.
        </li>
      </ol>

      <p>
        Программная реализация сервиса выполнена на языках
        PHP, java script, swift и java.
        База данных реализована на основе программного продукта с
        открытым исходным кодом MariaDB.
      </p>

      <!--- При раскрытии инструкции открывается окно с проигрывателем --->
      <h5 class="mb-3">
        <a
          @click="showPlayer"
          style="cursor: default"
          class="mainpage-map-link d-none d-md-block"
        >
          Инструкция по работе с сервисом
        </a>
      </h5>

      <h3>Использование данных сервиса</h3>

      <p>
        При использовании (воспроизведении, копировании) в сети
        Интернет любых материалов, размещенных на информационном
        ресурсе
        eqalert.ru
        , указание прямой ссылки является
        обязательным. Все URL адреса сервиса
        eqalert.ru
        , включая URL на сейсмические события, имеют постоянные ссылки.
        <br/>
        Цитирование (при использовании материалов сервиса в научных статьях):
        <br/>
        <a
          href="https://link.springer.com/article/10.3103/S0747923922060081"
          target="_blank"
        >Konovalov, A.V., Stepnov, A.A., Bogdanov, E.S. et al. New Tools for Rapid Assessment of Felt Reports and a Case Study on Sakhalin Island. Seism. Instr. 58, 676–693 (2022). https://doi.org/10.3103/S0747923922060081</a>
      </p>

      <p>Расшифровка обозначений:</p>

      <ul>
        <li>API (интерфейс прикладного программирования)</li>
        <li>Konovalov et al., 2022 (Konovalov, A.V., Stepnov, A.A. & Samsonov, G.A. A Logit-Based Binary Classifier of Tsunamigenic Earthquakes for the Northwestern Pacific Ocean. Pure Appl. Geophys.(2022). https://doi.org/10.1007/s00024-022-03194-7)</li>
        <li>g (ускорение свободного падения)</li>
        <li>Поплавская и др., 2006 (Региональный каталог землетрясений о. Сахалин, 1905-2005 / Л.Н. Поплавская и др. – Южно-Сахалинск, ИМГиГ ДВО РАН, 2006. 104 с.)</li>
        <li>DYFI («Did You Feel It?»)</li>
        <li>Wald et al., 1999 (Wald D.J., Quitoriano V., Dengler L.A., Dewey J.W. Utilization of the internet for rapid community intensity maps // Seismol. Res. Lett. 1999. V. 70. P. 680–697.)</li>
        <li>CWS (Community Weighted Sum)</li>
        <li>ШСИ-2017 (Шкала сейсмической интенсивности, 2017 г.)</li>
        <li>MSK-64 (Шкала Медведева-Шпонхойера-Карника, 1964 г.)</li>
        <li>Schulte, Mooney, 2005 (Schulte S.M., Mooney W.D. (2005). An updated global earthquake catalogue for stable continental regions: reassessing the correlation with ancient rifts, Geophysical Journal International, Volume 161, Issue 3, 2005, P. 707–721. https://doi.org/10.1111/j.1365-246X.2005.02554.x)</li>
        <li>Atkinson, Boore, 1995 (Atkinson G.M., Boore D.M. Ground-motion relations for eastern North America. Bulletin of the Seismological Society of America. 1995. 85(1):17-30.)</li>
        <li>Abrahamson, Silva, 1997 (Abrahamson N.A., Silva W.J. Empirical response spectral attenuation relations for shallow crustal earthquakes. Seismological Research Letters. 1997. 68(1):94, 127.)</li>
        <li>Akkar et al., 2014 (Akkar S., Sandkkaya M.A., Bommer J.J. Empirical ground-motion models for point- and extendedsourcecrustal earthquake scenarios in Europe and the Middle East // Bull. of Earthq. Engineering. 2014. 12(1):359-387, 2014. doi: 10.1007/s10518-013-9461-4)</li>
        <li>Jorjiashvili et al., 2022 (Jorjiashvili N., Shengelia I., Godoladze T., Gunia., Akubardia D. Ground motion prediction equations based on shallow crustal earthquakes in Georgia and the surrounding Caucasus. Earthq Sci. 2022. 35(6): 497–509, doi: 10.1016/j.eqs.2022.12.001)</li>
        <li>Morikawa, Fujiwara, 2013 (Morikawa N., Fujiwara H. “A New Ground Motion Prediction Equation for Japan Applicable up to M9 Mega-Earthquake.” Journal of Disaster Research. 2013. 8(5):878–88. doi: 10.20965/jdr.2013.p0878)</li>
        <li>Коновалов и др., 2018 (Коновалов А.В., Манайчев К.А., Степнов А.А., Гаврилов А.В. Региональная модель затухания сильных движений грунта для о. Сахалин // Вопросы инженерной сейсмологии. 2018. Т. 45, № 1. С. 19–30. https://doi.org/10.21455/VIS2018.1-2)</li>
      </ul>

    </div>

    <b-modal
      ref="mapDialog"
      title="Карта сейсмических станций"
      :no-close-on-backdrop="true"
      :hide-footer="true"
      :lazy="true"
      size="lg"
      @shown="onMapDialogOpen"
    >
        <MainpageMap ref="map" :onlyStations="true" :gestureHandling="false" />
    </b-modal>

    <b-modal
      ref="player"
      title="Инструкция по работе с сервисом"
      :no-close-on-backdrop="true"
      :hide-footer="true"
      :lazy="true"
      size="lg"
    >
      <iframe
        width="100%"
        height="100%"
        src="http://www.youtube.com/embed/V4Zwhi2frTk?autoplay=1"
        frameborder="0"
        allowfullscreen
      ></iframe>
    </b-modal>

  </div>
</template>

<script>

export default {
  name: 'static-page',
  components: {
    MainpageMap: () => process.client ? import('@/components/Map/Mainpage.vue') : null,
  },
  head() {
    return {
      title: 'О сервисе',
      meta: [
        {
          hid: 'description',
          name: 'description',
          content: "eqalert.ru - Сейсмологический сервис, предоставляющий актуальную информацию о землетрясениях на территории Российской Федерации. На сайте и мобильных приложениях представлена интерактивная карта землетрясений и подробная информация о произошедших событиях, обновляемая в режиме реального времени. Цель сервиса - развитие национального сейсмологического дата-центра для исследования сейсмической активности, оценки сейсмической опасности и риска. В сервисе используются данные международных и российских сейсмологических агентств, а также инструментальные измерения в рамках Сахалинской области."
        },
      ]
    }
  },
  methods: {
    showPlayer() {
      this.$refs.player.show()
    },
    showMap() {
      this.$refs.mapDialog.show()
    },
    onMapDialogOpen() {
      this.$refs.map.map.object.invalidateSize()
    }
  }
}
</script>

<style lang="scss" scoped>

@import 'assets/scss/_variables';
@import 'assets/scss/_mixins';
@import 'assets/scss/_modal_map.scss';

.static-page-content /deep/
{
  margin-top: 3%;

  h1, h2, h3, h4, h5, h6 {
    text-align: center !important;
  }

  img {
    display: block;
    margin: 0 auto;
    max-width: 100%;
  }
}

</style>
